ქვიზი 1

1. გახსენით ტერმინალი და გამოიტანეთ იმ დირექტორიის შიგთავსი სადაც მოხვდებით.
ქომანდი: ls
სქრინი:
2. გამოიტანეთ თუ სად იმყოფებით.
ქომანდი: pwd
სქრინი:
3. გამოიტანეთ ინფორმაცია თუ რომელ შელს იყენებს ტერმინალი.
ქომანდი: echo $0 ან echo $SHELL
სქრინი:
4. გამოიტანეთ შიგთავსი მათ შორის ჩანდეს დაფარული ფაილები.
ქომანდი: ls -a
სქრინი:

5. გამოიტანეთ დეტალური ლისტინგ მიმოხილვა შიგთავსის.
ქომანდი: ls -l
სქრინი:

6. გამოიტანეთ შიგთავსი ისე რომ ჩანდეს კლასიფიკაცია.
ქომანდი:ls -F
სქრინი:

7. შექმენი დირექტორია შენი გვარით და მასში შექმენით ფაილები fileA1, fileA5, fileA9, ..., fileA37, fileB1, fileB5, fileB9, ..., fileB37 ,...,fileK1,fileK5,fileK9,...,fileK37. (გამოიყენე მაგენერირებელი სიმბოლოები)
ქომანდი: mkdir chakhvadze; cd chakhvadze; touch file{A..K}{1..37..4}
სქრინი:

8. დირექტორია შენი გვარი-ში შექმენი A3,A6,A9,...,A66 დირექტორია.
ქომანდი: mkdir A{3..66..3}
სქრინი:

9. დირექტორია შენი გვარი-ში შექმნი დირექტორიები B9,B13,b17 ქვედირექტორიებით a,b,c,d,e.
ქომანდი: mkdir -p B9 B13 b17/{a,b,c,d,e}
სქრინი:

10. მენუალიდან ls ბრძანების შესახებ ინფორმაცია გადაამისამართეთ fileA1-ში.
ქომანდი: man ls > fileA1
სქრინი:

11. გამოიტანეთ fileA1 ფაილის შიგთავსი cat ბრძანებით.
ქომანდი: cat fileA1
სქრინი:

12. გამოიტანეთ fileA1 ფაილის შიგთავსი less ბრძანებით.
ქომანდი: less fileA1
სქრინი:

13. გამოიტანეთ fileA1 ფაილის შიგთავსი more ბრძანებით.
ქომანდი: more fileA1
სქრინი:


14. გამოიტანეთ ინფორმაცია თუ რა ტიპისაა ფაილი fileA1.
ქომანდი: file fileA1
სქრინი:

15. გამოიტანეთ ინფორმაცია თუ რა ტიპისაა ფაილი A3.
ქომანდი: file A3
სქრინი:

16. გამოიტანე სტრუქტურულ მახასიათებლებზე ინფორმაცია (რამდენი სტრიქონი, სიტყვა და სიმბოლოა) ფაილისთვის fileA1.
ქომანდი: wc fileA1
სქრინი:

17. რამდენი სტრიქონია fileA1-ში.
ქომანდი: wc -l fileA1
სქრინი:

18. რამდენი სიტყვაა fileA1-ში.
ქომანდი: wc -w fileA1
სქრინი:

19. რამდენი სიმბოლოა fileA1-ში.
ქომანდი: wc -m fileA1
სქრინი:

20. რამდენი ბაიტია fileA1-ში.
ქომანდი: wc -c fileA1
სქრინი:

21. ფიალ fileA1-ის შიგთავსი გადაკოპორე ფიალ fileA5-ში.
ქომანდი: cp fileA1 fileA5
სქრინი:

22. ფაილ fileA5-ს გადარქვი სახელი და დაარქვი btu.txt
ქომანდი: mv fileA5 btu.txt
სქრინი:

23. ფაილები რომლის სახელებიც მრთავდებიან 5-ზე გადაკოპირე B13-ში.
ქომანდი: cp -r *5 B13
სქრინი:

24. გადაამოწმე B13-ში გადაიტანა თუ არა 25-ე პუნქტში მითითებული ფაილები.
ქომანდი: ls B13
სქრინი:

25. ფაილები რომელთა სახელები იწყებიან fileK გადაიტანეთ B9-ში.
ქომანდი: mv fileK* B9
სქრინი:

26. cat ბრძანებით შექმენით ფაილი try და შეავსეთ თქვენი სახელით და გვარით.
ქომანდი: cat > try
სქრინი:

27. tee ბრძანებით შექმენით ფაილი try2 და შეავსეთ თქვენი სახელით, გვარით და წლოვანებით.
ქომანდი: tee try2
სქრინი:

28. გაიგე თუ სადაა განთავსებული echo ქომანდი.
ქომანდი: which echo
სქრინი:

29. გაიგე რომელ ქომანდებში ურეავია ip.
ქომანდი: mak -k ip ან apropos ip
სქრინი:

30. გამოიტანე ეკრანზე /etc/passwd ფაილის შიგთავსი.
ქომანდი: cat /etc/passwd
სქრინი:

31. გამოიტანე ეკრანზე /etc/passwd ფაილის შიგთავსი და ამავდროულად დაიმახსოვრე ეკრანზე გამოსული ტექსტი ფაილში user_info.
ქომანდი: cat /etc/passwd | tee user_ibfo
სქრინი:

32. გამოიტანე ინფორმაცია თუ რა ოპერაციული სისტემა აყენია და ყველაფერი მასთან დაკავშირებული.
ქომანდი: uname -a
სქრინი:

33. გამოიტანე იუზერის სახელი ვინც სისტემაშია შესული.
ქომანდი: whoami
სქრინი:

34. გამოიტანე იუზერის სახელი ვინც სისტემაშია შესული და რომელი ტიპის ტერმინალით ურთიერთობს სისტემასთან.
ქომანდი: who
სქრინი:

35. გამოიტანე იუზერის სახელი ვინც სისტემაშია შესული, ჩანდეს რომელი ტიპის ტერმინალით ურთიერთობს სისტემასთან და რა ამოცანა აქვს გაშვებული.
ქომანდი: w
სქრინი:

36. გამოიტანე იუზერის სახელი ვინც სისტემაშია შესული და ასევე ჩანდეს წარსულის დალოგინების ისტორია.
ქომანდი: last
სქრინი:

37. გამოიტანე ინფორმაცია სისტემის დატვირთულობის შესახებ.
ქომანდი: uptime
სქრინი:

38. გამოიტანე ინფორმაცია ოპერატიული მეხსიერების მოცულობის ამჟამინდელი მდგომარეობის შესახებ.
ქომანდი: free
სქრინი:

39. გამოიტანე ინფორმაცია ოპერატიული მეხსიერების მოცულობის ამჟამინდელი მდგომარეობის შესახებ ადამინისთვის ადვილად აღსაქმელ ფორმატში ანუ ჩანდეს სიდიდის საზომი.
ქომანდი: free -h
სქრინი:

40. გამოიტანე ინფორმაცია თუ რომელი ჯგუფის წევრია თქვენი იუზერი.
ქომანდი: groups ან id
სქრინი:
41. შენ პირად დირქტორიიდან გამოიტანე დაფარული ფაილები.
ქომანდი: ls -a ~
სქრინი:

42. ქომანდების ls, grep, chmod შესახებ ინფორმაცია გადაამისმართეთ ფაილში myfile.
ქომანდი: man {ls,grep,chmod} >myfile
სქრინი:

43. გამოიტანე myfile ფაილის ყველაზე გრძელი სტრიქონზე ინფორმაცია.
ქომანდი: wc -L myfile
სქრინი:
44. გამოიტანე მიმდინარე თარიღი.
ქომანდი: date
სქრინი:

45. წაშალე მე7 და მე8 პუნქტში შექმნილი ფაილები.
ქომანდი: rm -r *
სქრინი:

ქვიზი 2

1.	შექმენი დირექტორია გვარი_quiz2 დირექტორია. გადადი მასზე და გაგრძელე შემდეგი პუნქტების გაკეთება.
ქომანდი: mkdir chakhvadze_quiz2; cd chakhvadze_quiz2; pwd
სქრინი:

2.	 echo ქომანდის გამოყენებით შეიტანეთ ფაილ btu-ში ტექსტი dges 1 laris gacvliTi kursi $2.55-zea.
ქომანდი: echo “dges 1 laris gacvliTi kursi \$2.55-zea”
სქრინი:

3.	შენ პირად დირექტორიიდან გამოიტანე დაფარული ფაილები. გახსენი და გამოიტანე .bash_history ფაილის მხოლოდ ის ხაზები სადაც მონაწილეობს c სიმბოლო.
ქომანდი: ls -a ~; cat ~/.bash_history | grep c
სქრინი:

4.	შენ პირად დირქტორიიდან გამოიტანე დაფარული ფაილები. გახსენი და გამოიტანე .bash_history ფაილის მხოლოდ ის ხაზები სადაც მონაწილეობს c სიმბოლო და გამოიტანე ინფორმაცია რამდენ ხაზში იპოვა c სიმბოლო.
ქომანდი: ls -a ~; cat ~/.bash_history | grep c | wc -l
სქრინი:

5.	გამოიტანეთ ეკრანზე ბაინერ /bin/echo ფაილის შიგთავსი.
ქომანდი: stings /bin/echo
სქრინი:

6.	ქომანდების lsattr, getfacl, chmod, touch შესახებ ინფორმაცია გადაამისმართეთ ფაილში myfile.
ქომანდი: man { lsattr,getfacl,chmod,touch } > myfile
სქრინი:

7.	შექმენი სიმბოლური ლინკი ფაილ myfile-ზე სახელით myslink.
ქომანდი: ln -s myfile myslink
სქრინი:

8.	გამოიტანე აინოუდები myfile და myslink-სთვის.
ქომანდი: ls -i myfile myslink
სქრინი:

9.	გამოიტანე აინოუდები და სხვა დაწვრილებითი ინფორ ინფორმაციები myfile და myslink-სთვის.
ქომანდი: ls -il myfile myslink
სქრინი:

10.	შექმენი ჰარდ ლინკი ფაილ myfile-ზე სახელით myhlink.
ქომანდი: ln myfile myhlink
სქრინი:

11.	გამოიტანე აინოუდები myfile და myhlink-სთვის.
ქომანდი: ls -il myfile myhlink
სქრინი:

12.	გამოიტანე ფაილური სიტემის ატრიბუტები ფაილისთვის myfile.
ქომანდი:lsattr myfile
სქრინი:

13.	დააყენე ისეთი ფაილურის სიტემის ატრიბუტი ფაილისთვის myfile რომ ის არ იყოს დარედაქტირებადი.
ქომანდი:chattr +i myfile
სქრინი:

14.	წაიკითხე ფაილი myfile ნანოთი.
ქომანდი: nano myfile
სქრინი:

15.	მოხსენი ფაილურის სიტემის ატრიბუტი ფაილისთვის myfile რომ ის იყოს კვლავ დარედაქტირებადი.
ქომანდი: chattr -i myfile
სქრინი:

16.	გამოიტანე წვდომის კონტროლის სია ფაილისთვის myfile.
ქომანდი:getfacl myfile
სქრინი:

17.	გამოიტანეთ იუზერ მასკი.
ქომანდი: umask
სქრინი:

18.	შექმენი ფაილი გვარი და დირექტორია სახელი. გამოიტანე წვდომის ატრიბუტები.
ქომანდი: touch chakhvadze; mkdir aleksandre
სქრინი:

19.	შეცვალე იუზერ მასკი 007-ით.
ქომანდი: umask 007
სქრინი:

20.	შექმენი ფაილი გვარი2 და დირექტორია სახელი2. გამოიტანე წვდომის ატრიბუტები.
ქომანდი: touch chakhvadze2; mkdir aleksandre2
სქრინი:

21.	დაუბრუნე იუზერ მასკს ძველი მდგომარეობა.
ქომანდი: umask 0002
სქრინი:

22.	მენუალიადან იერარქიული ფაილთა სისტემის შესახებ ინფო გადაამისამართე ფაილში info-test. გამოიტანე მასზე წვდომის ატრიბუტები.
ქომანდი: man hier > info-test; ls -l info-test
სქრინი:

23.	გაანულე წვდომის ატრიბუტები ციფრული მითითებით ფაილზე info-test.
ქომანდი: chmod 000 info-test
სქრინი:

24.	ფაილზე info-test დააყენე წვდომის ატრიბუტები ციფრულად ისე რომ მფლობელ იუზერს შეეძლოს ყველაფრის გაკეთება, ჯგუფს მხოლოდ წაკითხვა და სხვა დანარჩენ იუზერებს კი წაკითხვაც და რედაქტირებაც.
ქომანდი: chmod 746 info-test
სქრინი:

25.	ფაილზე info-test დააყენე წვდომის ატრიბუტები სიმბოლურად ისე რომ მფლობელ იუზერს შეეძლოს წაკითხვა და რედაქტირება, ჯგუფს მხოლოდ წაკითხვა და სხვა დანარჩენ იუზერებს კი მხოლდოდ გაშვება.
ქომანდი: chmod u=rw,g=r,o=x info-test
სქრინი:

26.	შექმენი ფაილი test და შეიტანე ახალ ახალ ხაზზე შემდეგი ბრძანებები: ls, pwd, date, groups, free -h, ls /, uptime, who, df, users, hostname.
ქომანდი: nano test
სქრინი:

27.	ფაილზე test მფლობელ იუზერს მიუმატე გაშვების ატრიბუტი.
ქომანდი: chmod u+x test
სქრინი:

28.	სრული მიმართით გაუშვით ფაილი test.
ქომანდი:./test
სქრინი:

29.	ფაილზე test-ზე დააყენე 664 წვდომა და ასევე SUID, SGID, Sticky bit ატრიბუტებიც.
ქომანდი:chmod 7664 test
სქრინი:

30.	გამოიტანე პირადი დირექტორიის ლონგ ლისტური შიგთავსი წვდომის დროით დასორტირებული.
ქომანდი:ls -lt ~
სქრინი:

ქვიზი 3

1. დაამატე იუზერი exam ისე რომ ჰქონდეს პირადი დირექტორია.
ქომანდი: sudo useradd -m exam
სქრინი:

2. დაამათე იუზერი tbilisi ისე რომ არ ჰქონდეს პირადი დირექტორია.
ქომანდი: sudo useradd tbilisi
სქრინი:

3. გადაამოწმე ვისი პირადი დირექტორიები გვაქვს home დირექტორიაში.
ქომანდი: ls /home
სქრინი:

4. შეამოწმე რომ იუზერთა ჩამონათვალს დაემატა შექმნილი იუწერები exam და tbilisi.
ქომანდი: tail /etc/passwd
სქრინი:

5. შექმენი იუზერი try ჰქონდეს პირადი დირექტორია, იუზერ აიდით 4000, მასზე იყოს კომენტარი cda ar daaklo, შელის სახეობად ჰქონდეს /bin/bash.
ქომანდი: sudo useradd -m u 4000 -c “cda ar daaklo” -s /bin/bash try
სქრინი:

6. დაადე პაროლები მომხმარებლებს exam, tbilisi და try.
ქომანდი: sudo passwd exam; sudo passwd tbilisi; sudo passwd tray;
სქრინი:

7. გამოიყენე შემნაცვლებელი იუზერის ფუქნცია, მიიღე exam მომხმარებლის ფუნქციონალი ისე რომ მოხვდე მის პირად დირექტორიაში. გადაამოწმე სად იმყოფები.
ქომანდი:su – exam; pwd
სქრინი:

8. გამოიყენე შემნაცვლებელი იუზერის ფუქნცია, მიიღე exam მომხმარებლის ფუნქციონალი ისე რომ დარჩე იგივე ადგილას საიდანაც ამ ქომანდს გაუსვებ. გადაამოწმე სად იმყოფები.
ქომანდი:su exam; pwd
სქრინი:

9. chsh ქომანდის გამოყენებით შეუცვალე exam იუზერს შელი და გახადე ახლა /bin/dash.
ქომანდი:sudo chsh exam და მიუთითებს შესაყვან ველში /bin/dash-ს.
სქრინი:

10. usermod ქომანდის გამოყენებით შეუცვალე exam იუზერს შელი და გახადე ახლა /bin/bash.
ქომანდი: sudo usermod -s /bin/bash exam
სქრინი:

11. შეუცვალე exam იუზერს იუზერ აიდი და გახადე ახლა 3900.
ქომანდი: sudo usermod -u 3900 exam
სქრინი:

12. chfn ქომანდის გამოყენებით შეუცვალე exam იუზერს კომენტარის ველი და შეიტანე შემდეგი ინფორმაციები: სრული სახელი exam btu, ოთახი 202, სამსახურის ტელეფონი 598123123, სახლის ტელეფონი +99502232323.
ქომანდი: sudo chfn exam და შესაყვან ვე;ლში შეიტან სათანადო ინფორმაციას.
სქრინი:

13. შეამოწმე იუზერთა ჩამონათვალი და მათი ინფოები.
ქომანდი: tail /etc/passwd
სქრინი:

14. usermod ქომანდის გამოყენებით შეუცვალე exam იუზერს კომენტარის ველი es iyos axla ტექსტით.
ქომანდი: sudo usermod -c “es iyos axla” exam
სქრინი:

15. გადაამოწმე /etc/skel დირექტორიის შიგთავსი.
ქომანდი: ls /etc/skel
სქრინი:

16. გადადადი /etc/skel დირექტორიაში და შექმენი ფაილი test.txt შიგთავსით I Love BTU.
ქომანდი: cd /etc/skel; nano test.txt და შეიტანთ I Love BTU-ს და ctrl+x-ით დაასეივებთ და გამოხვალთ ფაილიდან.
სქრინი:

17. შექმენი იუზერი try2 ჰქონდეს პირადი დირექტორია, იუზერ აიდით 4010, მასზე იყოს კომენტარი cdas ar aklebs, შელის სახეობად ჰქონდეს /bin/bash.
ქომანდი: sudo useradd -m -u 4010 -c “cdas ar aklebs” -s /bin/bash try2
სქრინი:

18. დაადე პაროლი try2 იუზერს.
ქომანდი: sudo passwd try2
სქრინი:

19. გადაამოწმე try2 იუზერის პირადი დირექტორია და დარწმუნდი რომ test.txt ფაილი იქაა.
ქომანდი:ls /home/try2
სქრინი:

20. გადადადი ან დაბრუნდი /etc/skel დირექტორიაში და წაშალე ფაილი test.txt.
ქომანდი:cd /etc/skel; sudo rm *
სქრინი:

21. წაშალე try2 იუზერი ისე რომ არ დარჩეს მისი პირადი დირექტორია.
ქომანდი:sudo userdel -r try2
სქრინი:

22. დაამატე ჯგუფი tbiliselebi.
ქომანდი:sudo groupadd tbiliselebi
სქრინი:

23. დაამატე ჯგუფი BTU ჯგუფის აიდით 3021.
ქომანდი:sudo groupadd -g 3021 BTU
სქრინი:

24. ჯგუფი tbiliselebi-ის წევრი გახადე იუზერი tbilisi.
ქომანდი: sudo usermod -aG tbiliselebi tbilisi
სქრინი:

25. ჯგუფი BTU-ის წევრი გახადე იუზერი exam.
ქომანდი: sudo usermod -aG BTU exam
სქრინი:

26. გადაამოწმე რა ჯგუფების წევრია იუზერი tbilisi.
ქომანდი:groups tbilisi ან id tbilisi
სქრინი:

27. გადაამოწმე რა ჯგუფებისწევრია იუზერი exam.
ქომანდი: groups exam ან id exam
სქრინი:

28. შენ პირად დირექტორაიში შექმენი ფაილი work.doc. გამოიტანე მისი ლოგნგ ლისტური პარამეტრები. შეცვალე მფლობელი იუზერი და ჯგუფი და შენი იუზერის ნაცვლად გახადე exam იუზერი და tbiliselebi ჯგუფი.
ქომანდი:cd ~; touch work.doc; ls -l work.dok; sudo chown exam:tbiliselebi work.doc
სქრინი:

29. როგორც რუთმა წაშალე ფაილი work.doc.
ქომანდი:sudo rm work.doc
სქრინი:

30. წაშალე იუზერები try, tbilisi და exam სრულყოფილად. წაშალე ჯგუფები tbiliselebi და BTU. გადაამოწმე როელი იუზერები და ჯგუფები არის ახლა.
ქომანდი: sudo userdel -r try; sudo userdel -r tbilisi; sudo userdel -r exam; sudo groupdel tbiliselebi; sudo groupdel BTU;
სქრინი:

31. გამოიტანეთ მიმდინარე ტერმინალის სესიაში გაშვებული პროცესები.
ქომანდი:ps
სქრინი:

32. გამოიტანეთ მიმდინარე ტერმინალის სესიაში გაშვებული პროცესები დამატებითი ინფორმაციით.
ქომანდი:ps x
სქრინი:

33. გამოიოტანეთ ყველა გაშვებული პროსესი.
ქომანდი:ps ux
სქრინი:

34. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები.
ქომანდი: ps aux
სქრინი:

35. გამოიტანეთ პროცესების იერარქიული ხისებრი სქემა.
ქომანდი:pstree
სქრინი:

36. გამოიტანეთ თქვენი მომხმარებლის გაშვებული პროცესები.
ქომანდი:ps -e
სქრინი:

37. გამოიტანეთ თქვენი root მომხმარებლის გაშვებული პროცესები.
ქომანდი:ps -U user -u root
სქრინი:

38. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული პროცესორის გამოყენებადობის მიხედვით კლებით.
ქომანდი:ps aux --sort -pcpu
სქრინი:

39. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული პროცესორის გამოყენებადობის მიხედვით ზრდით.
ქომანდი: ps aux --sort pcpu
სქრინი:

40. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული ოპერატიული მეხსიერების გამოყენებადობის მიხედვით კლებით.
ქომანდი: ps aux --sort -pmem
სქრინი:

41. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული ოპერატიული მეხსიერების გამოყენებადობის მიხედვით ზრდით.
ქომანდი: ps aux --sort pmem
სქრინი:

22. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული რეალურად დაკავებული მეხსიერების ზომის მიხედვით კლებით.
ქომანდი: ps aux --sort -rss
სქრინი:

43. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული რეალურად დაკავებული მეხსიერების ზომის მიხედვით ზრდით.
ქომანდი: ps aux --sort rss
სქრინი:

44. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული ვირტუალური მეხსიერების ზომის მიხედვით კლებით.
ქომანდი: ps aux --sort -vsz
სქრინი:

45. გამოიტანეთ ყველა მომხმარებლის ყველა პროცესი მათ შორის ბექგრაუნდ პროცესები დალაგებული ვირტუალური მეხსიერების ზომის მიხედვით ზრდით.
ქომანდი: ps aux --sort vsz
სქრინი:

46. გამოიტანეთ ხელოვნურად ორგანიზებული ყველა გაშვებული პროცესი შემდეგი თანმიმდოვრობით განლაგებული მახსაიათებლით პროცეს აიდი, პროცესის მშობელი აიდი, იუზერი, დახარჯული დრო, დასტყარტვის დრო, გამოყოფილი ვირტუალური მეხსიერება, დაკავებული რეალური ზომა, პროცესის სახელი, მოხმარებული პროცენტული წილი პროცესოირში, მოხმარებული პროცენტული წილი ოპერატიულ მეხსიერებაში.
ქომანდი:ps -eo pid,ppid,user,time,start,vsz,rss,comm,pcpu,pmem
სქრინი:

47. გამოიტანეთ სისტემის დატვირთულობის შესახებ ინფორმაცია;
ქომანდი: uptime
სქრინი:

48. გამოიტანეთ სისტემის რესურსების სტატისტიკური ინფორმაცია;
ქომანდი:vmstat
სქრინი:

49. ოპერატიული მესხიერების შესახებ ინფორმაცია დაკავებული და თავისუფალი ზომები.
ქომანდი: free
სქრინი:

50. გაუშვით ფონურ რეჯიმში ანუ ბექგრაუნდზე xclock, xlogo, gedit, gnome-calculator, gnome-sudoku.
ქომანდი: xclock &; xlogo &; gedit &; gnome-calculator &; gnome-sudoku &
სქრინი:

51. გამოიტანეთ ბექგრაუნდზე გაშვებული პროცესები და მათი პროცესის აიდები.
ქომანდი: jobs -l
სქრინი:

52. გადაიტანეთ წინა პნაზე (მხარეს) ანუ ფორეგრაუნდზე gedit და მოკალით პროცესი.
ქომანდი:fg gedit; ctrl+c
სქრინი:

33. გადაიტანეთ წინა პნაზე (მხარეს) ანუ ფორეგრაუნდზე gnome-sudoku და დააზომბეთ პროცესი.
ქომანდი: fg gnome-sudoku; ctrl+z
სქრინი:

54. დაზომბებული gnome-sudoku გადაიტანეთ ისევ ფონურზე ანუ ბექგრაუნდზე.
ქომანდი:bg gnome-sudoku
სქრინი:

55. გაუშვით ფონურ რეჯიმში ანუ ბექგრაუნდზე gedit ისე რომ არ დაიკარგოს თუკი სესია დაიხურება.
ქომანდი:gedit & disown
სქრინი:

56. მოკალი მე15 სიგნალით xclock პროცესი (მისი აიდის ნახვა jobs -l შეიძლება).
ქომანდი: kill -15 ‘pid of xclock’
სქრინი:

57. მოკალი პირველი სიგნალით xlogo პროცესი (მისი აიდის ნახვა jobs -l შეიძლება).
ქომანდი: kill -15 ‘pid of xlogo’
სქრინი:

58. მოკალი მე2 სიგნალით gnome-calculator პროცესი (მისი აიდის ნახვა jobs -l შეიძლება).
ქომანდი: kill -2 ‘pid of gnome-calculator’
სქრინი:

59. მოკალი მე9 სიგნალით gnome-sudoku პროცესი (მისი აიდის ნახვა jobs -l შეიძლება).
ქომანდი: kill -2 ‘pid of gnome-sudoku’
სქრინი:

60. გაუშვი ბექგრაუნდზე gnome-calculator. დაასტოპე და შემდეგ კვლავ გაგრძელე პროცესი. დააპაუზე დააზომბე ეს პროცესი.
ქომანდი:gnome-calculator &; kill -19 ‘pid of calculator’; kill -18 ‘pid of calculator’; kill -20 ‘pid of calculator’
სქრინი:

61. გაუშვი ბექგრაუნდზე xlogo 5 ჯერ. მოკალი ყველა ეს პროცესი სრული დასახელებით.
ქომანდი:xlogo &; xlogo &; xlogo &; xlogo &; xlogo &; killall xlogo
სქრინი:

62. გაუშვი ბექგრაუნდზე xclock 7 ჯერ. მოკალი ყველა ეს პროცესი სახელის ნაწილით კერძოდ xclo. თუმცა ჯერ გადაამოწმე pgrep -l  xclo მხოლოდ ამ პროცესებს აბრუნებს თუ სხვებს. იყავი ფრთხილად ამ სემთხვევაში რომ არ დააზიანო რამე.
ქომანდი: xclock &; xclock &; xclock &; xclock &; xclock &; xclock &; xclock &; pgrep -l xclo; pkill xclo
სქრინი:

63. გაუშვი xlogo ბექგრაუნდზე და მოკალი ეს პროცესი ფანჯარაზე დაწკაპუნებით.
ქომანდი: xlogo &; xkill
სქრინი:

64. გაუშვი gnome-sudoku პროცესი ბექგრაუნდზე 7 პრიორიტეტით.
ქომანდი: nice -n 7 gnome-sudoku &
სქრინი:

65. ბექგრაუნდზე გაშვებულ gnome-sudoku პროცესს  7 პრიორიტეტი გადაუწიე 12-ზე. მოკალი ეს პროცესი.
ქომანდი: renice -n 12 -p ‘pid of gnome-sudoku’
სქრინი:


linux commands
> is used to redirect the standard output of a command to a file. თუ ფაილი არ არსებობს, შეიქმნება. თუ არსებობს, გადაეწერება ახალი ინფო/ტექსტი
           	Echo “Hello, World!” > output.txt
>> is used to append the standard output of a command to a file. ფაილი თუ არ არსებობს, შეიქმნება, თუ არსებობს, დაემატება ახალი ინფო/ტექსტი
           	Echo “New Content” >> output.txt
< is used to redirect the standard input of a command from a file
           	Grep “keyword” < input.txt - ეძებს სიტყვა “keyword“-ს input ფაილში
| [pipe] – is used to redirect the output of one command as input to another command
           	ls -l | grep “file”
& - სიმბოლო იწერება პროგრამის/ბრაუზერის სახელის შემდეგ. ეს ქომანდი ჩართავს პროგრამას/ბრაუზერს მასში ცვლილებების შეტანის უფლებით
!7 - გარანავს მეშვიდე ქომანდს ისტორიიდან
/user/share/doc/ - directory of documentation for software packages
<command> --help - გამოაქვს ქომანდის მოკლე აღწერა გამოყენებასა და არგუმენტებზე
alias (name)="command"
apropos {keyword} – search the manual page and descriptions
cal - კალენდრისთვის
cal feb 1993 f.ecat file1 - გამოაქვს file1-ის შიგთავსი
cd (f.e. (/var/log)) - ცვლის სამუშაო დირქტორიებს
           	cd. - მიმდინარე დირექტორია
           	cd.. - მშობელი დირექტორია
           	cd- - წინა დირექტორიაში გადასვლა
           	cd~ - თავდაპირველ დირექტორიაში დაბრუნება
chattr +i file1 - ფაილურ სისტემაში ატრიბუტის დამატება
           	-i file1 - ფაილურ სისტემაში ატრიბუტის წაშლა
chfn –  sudo chfn username (და ამის მერე შეგვყავს მოცემული ინფო)
chgrp – sudo chgrp groupname file.txt
chmod u+w, g+r-w, o+r-x file1 - ანიჭებს/წაარათმევს წვდომებს იუზერს, ჯგუფს, სხვებს
chmod u=rw, g=r, o=r file2 – file2 გადაჰყავს იმავე რეჟიმში, რომელშიც არის file1
chmod a+x file1 – file1-ში იუზერს, ჯგუფს, სხვებს ანიჭებს ყველას ერთად execute წვდომასზ
chown – changing file ownership
           	chown username:groupname file1 – file1-ზე ownership აქვთ იუზერ username-ს და ჯგუფ groupname-ს
chsh username /bin/dash - უცვლის იუზერს შელს
clear - ტემინალის ეკრანის გასუფთავება
cmp file.txt file1.txt - ბიტებში ადარებს ფაილებს
comm file.txt file2.txt - ადარებს ფაილებს და პასუხი სამ სვეტად გამოაქვს:
           	პირველ სვეტში მხოლოდ ის ხაზია რომელიც მხოლოდ პირველ ფაილშია
           	მეორე სვეტში მხოლოდ ის ხაზია რომელიც მხოლოდ მეორე ფაილშია
           	მესამე სვეტში კი ერთნაირი, საერთო ხაზებია მოცემული
cp file1 file2 - აკოპირებს ფაილს ან დირექტორიას
           	cp -r dir1 /dir2
date - მიმდინარე თარიღი
df (df -h) - სისტემაზე დისკის მოცულობა
diff - ადარებს რამდენიმე ფაილს ერთდროულად, შეუძლია გადაიტანოს პასუხი სხვა ფაილში
du * - გვანახებს რამდენი ბლოკი დაიკავა დისკზე მიმდინარე დირექტორიის ფაილებმა, მოიაზრება 1024 ბაიტი
           	du -b * - სვეტებში გვანახებს ფაილის რეალურ ზომებს ó ls -l
           	du -sh ~ - გამოიტანს პირადი დირექტორიის ჯამურ ზომას
           	du -sbc ~/* - გამოიტანს პირად დირექტორიაში შემავალი ყველა ფაილისა და დირექტორიის ჯამურ ზომას ბაიტებში
echo - ტერმინალზე ტექსტის დაპრინტვა
exit - გამოსვლა
free - სისტემის თავისუფალი და დაკავებული მეხსიერების რაოდენობები kilobytes
find - ფაილებს ეძებს მოც. დირექტორიების მთლიან იერარქიულ სტრუქტურაში, ქვე-დირექტორიებშიც
           	find ~ - ჩვენს პირად დირექტორიაში არსებულ ყველა ფაილს გვანახებს ეკრანზე
           	find ~ | wc -l - ითვლის ამ ფაილების რაოდენობას
           	find ~ -type d –
           	find ~ -type f | wc -l – f ჩვეულებრივი ფაილების მოსაძებნად, l შორთქათებისთის
           	find ~ -name test.txt - ფაილს ეძებს სახელით
           	find ~ -name “*.txt” - ყველა txt ფაილი გამოაქვს
           	find . -perm 664 - შეესაბამება მხოლოდ იმ ფაილს, რომელსაც 664 უფლება აქვს
           	find ~ -type f \( -name “a*” -or -name “b*” \) - მოძებნის ჩვეულებრივი ტიპის ყველა ფაილს, რომლის სახელიც a ან b-თი იწყება
           	-iname file -    -name-ის მსგავსია, მხოლოდ ფაილის დასახელებაში დიდსა და პატარა ასოებს აღარ გაარჩევს.
           	-empty -  ცარიელი ფაილი ან დირექტორია
           	-user username  - მიესადაგება ყველა იმ ფაილს, რომლის მფლობელი არის username
           	-group groupname - მიესადაგება ყველა ფაილს, რომლის მფლობელის ჯგუფი არის groupname
           	-perm mode - აღნიშნავს ყვლა ფაილს, რომელზე წვდომის უფლებებიც ემთხვევა მითითებული mode-ს. mode-ის ჩაწერა, როგორც chmod ბრძანების შემთხვევაში, 2 სახითაა შესაძლებელი: ციფრული ან სიმბოლური.
           	-mtime n - მიესადაგება იმ ფაილებს, რომლებიც n*24 საათის წინ შეიცვალა. შესაძლებელია, აგრეთვე, -n ან +n გამოვიყენოთ n-ზე ნაკლების ან მეტის აღსანიშნავად.
           	-atime n - მიესადაგება იმ ფაილებს, რომლებსაც სტატუსი n*24 საათის წინ შეუცვალეს.
           	-ctime n - მიესადაგება იმ ფაილებს, რომლებსაც, სტატუსი n*24 საათის წინ შეუცვალეს
           	-mmin n –  | მიესადაგება ყველა ფაილს, რომელთა შესაბამისი მახასიათებელიც n წუთის წინ შეიცვალა.
           	-amin n –   | აქაც შესაძლებელია აქგრეთვე -n ან +n გამოყენება n-ზე ნაკლების ან მეტის აღსანიშნავად
           	-cmin n –   |
           	-newer file - მიესადაგება ყველა ფაილს, რომლის mtime-იც უფრო ახალია ვიდრე file-ის mtime
           	-anewer file - | მიესადაგება ყველა ფიალს, რომლის atime/ctime
           	-cnewer file - | უფრო ახალია ვიდრე file-ის mtime
           	. -perm -444 -perm /222 ! -perm /111 - მოძებნის ყველა ფაილს რომლის კითხვაც ყველას შეუძლია (-perm -444), ცვლილების გაკეთება - ერთ-ერთს (მფლობელს, ჯგუფს ან სხვა მომხმარებელს) მაინც (-perm /222) და შესურლება - არავის (! -perm /111).
           	ზომის მიხედვით ფაილების მოძიება ხდება -size კრიტერიუმის მიხედვით. უნდა მივუთითოთ ზომა და ერთეული. ეს ერთეულებია: c - ბაიტის აღსანიშნავად; w - ორბაიტიანი სიტყვა; k - კილობაიტი; M - მეგაბაიტი; G - გიგაბაიტი ან b – 512ბაიტიანი ბლოკი. თუ ერთეულს არ მივუთითებთ, ნაგულისხმევი მნიშვნელობა სწორედ b იქნება.
fmt - ბრძანება ტექსტური ფაილების ფორმატირებასა და ოპტიმიზაციას უზრუნველყოფს
           	-w, --width= - მიუთითებს ხაზზე რამდენი ასო-ნიშანი შეიძლება დაეტიოს. ნაგულისხმევი - 75, ქართული - 25
           	-t, --tagged-paraghraph - უკეთესი კითხვადობისთვის გამოყოფს აბზაცს
           	-s, --split-only - უკეთესი კითხვადობისთვის გამოყოფს გრძელ ხაზებს
           	-u, --uniform-spacing - აერთგვაროვნებს ტექსტს. სიტყვებს შორის სვამს მაქსიმუმ ერთ გამოტოვებას, ხოლო წინადადებებს შორის კი 2-ს.
getfacl file1 - გამოაქვს დამატებითი ACL წვდომები
grep (global regular expression print)
           	grep “pattern” file.txt - ეძებს კონკრეტულ “pattern”-ს ფაილში და გამოაქვს ხაზები, რომლებიც მას შეიცავენ
           	“^error” file.txt - ^ სიმბოლოს გამოაქვს ყველა ხაზი რომლებიც იწყება სიტყვით error ფაილში
           	-r “pattern” /path/to/directory - This command recursively searches for the specified "pattern" in all files within the /path/to/directory and its subdirectories.
           	-n “pattern” file.txt – This command shows the line numbers for each line containing the specified "pattern" in file.txt
           	-i “pattern” file.txt – This command searches for the specified "pattern" in file.txt regardless of letter case
           	-v “pattern” file.txt – This command shows all lines in file.txt that do not contain the specified "pattern."
groupadd groupname - ჯგუფის შექმნა
           	groupadd –gid 888 developers - დეველოპერების ჯგუფი შეიქმნა აიდით 888
groupdel groupname - ჯგუფის წაშლა
groups username - ამოწმებს რომელი ჯგუფის წევრია იუზერი
help [command] - იგივეა რაც man ოღონდ builtin command-ებისთვის
history - გამოყენებული ქომანდების ისტორია ქრონოლოგიურად
hostname - სისტემის სახელი
id username - გამოაქვს იუზერის რამდენიმე აიდი (uid; gid; groups)
info (file) - ეკრანზე გამოაქვს განმარტება /usr/share/info/
info {command} - გამოაქვს ინფორმაცია ქომანდზე
kill -L - გამოაქვს სიგნალების სია
           	kill -SIGKILL process_ID – terminates/kills the program/browser using its ID  [kill -9 PID]
           	kill -SIGSTOP PID –	| ეს ორი პროცესი აჩერებს და აგრძლებს ვიდეოს ბრაუზერში
           	kill -SIGCONT PID –   | იყენებს ბრაუზერის PID-ს
less file1 - გამოაქვს file1-ის შიგთავს გვერდებად/ნაწილებად
           	UP and DOWN arrow keys
ln original-file hard-link - ქმნის hard-link-ს (მხოლოდ ფაილს)[same inode]
ln -s original-file soft-link - ქმნის soft-link-ს (ფაილიც და დირექტორიაც)[different inode]
ls - იმ დირექტორიის შიგთავსის სია, რომელშიც მუშაობ
           	ls /var/log - /var/log-ის შეგთავსი გამოაქვს
           	ls -a - დაფარული ფაილების გამოსაჩენად [--all]
           	ls -a -l - გრძელი სია ფაილების, + დაფარული ფაილები
           	ls -d - list directories themselves, not their contents
           	ls -I – file - ბეჭდავს inode-ს ó stat file
           	ls -l - დირექტორიის შიგთავსის დეტალური სია
           	ls -l -a -t -r ó ls -latr
           	ls -l -t - გრძელი სია by modification times, newest first
           	ls -l -t -r - შეაბრუნებს ჩამონათვალს
           	ls -l -t -u - sort by access times
           	ls -la - იმ დირექტორიის შიგთავსის სია(დამალული ფაილებიც), რომელშიც მუშაობ
           	ls -la /var/log - /var/log-ის შეგთავსი გამოაქვს დამალულ ფაილებთან ერთად
           	ls -R - recursive listing
lsattr file1 - გამოიყნება ფაილური სისტემის ატრიბუტების სანახავად, რომლებიც მინიჭებულია ფაილზე
lsb_release -a - უბუნტუს ვერსია, რომელსაც ვიყენებთ იმ კონკრეტულ მომენტში
lscpu - CPU ინფო
man (command) - გამოაქვს command-ის ინფო, რისთვის გამოიყენება
           	space/ Ctrl+F - მომდევნო გვერდზე გადადის
           	Ctrl+B - წინა გვერდზე გადადის
           	/word - ეძებს word-ს
           	q – quit the man page
           	n - სიტყვის მოძებნის შემდეგ next occurrence
           	N - სიტყვის მოძებნის შემდეგ previous occurance
           	man -f ó whatis
           	man -k ó apropos
mkdir newdir - ქმნის ახალ დირექტორიას
           	mkdir -p dir1/dir2/dir3 - რამდენიმე დირექტორიის შექმნა ერთმანეთის შიგნით
more /etc/services - ფაილის კონტენტი
           	Enter - scroll down one line
           	Space Bar - next page
           	b - go back one page
           	q - quit
mv - გადააქვს დირექტორია/ფაილი სხვა დირექტორიაში ან უცვლის დასახელებას დირექტორიას/ფაილს
nice -n -20 - პროცესის დასტარტვა ჩვენ მიერ მინიჭებული პრიორიტეტის მიხედვით
           	nice -n -20 apt-get upgrade – upgrades all the packages on the system
passwd - პაროლის შეცვლა
patch test.txt t1_t2.diff - ორიგინალი ფაილით და ახალი შექმნილი ფაილით(რომელშიც შედარების შედეგია ჩაწერილი) შეგვიძლია აღვადგინოთ მეორე ორიგინალი ფაილის შიგთავსი
ps -u username - გამოაქვს ყველა პროცესი, რომლებსაც კონკრეტული იუზერი ფლობს
           	ps -e  - გამოაქვს ყველა პროცესი, რომლებიც იმ მომენტში არის მიმდინარე/running
           	ps -ef – [ps -e] იგივე ოღონდ მეტი ინფო გამოაქვს
           	pgrep process_name - გვაძლევს process_name-ის ID-ს
           	ps -fp process_ID – გვაძლევს ინფოს პროცესის შესახებ
           	ps -o nice -p PID - გამოაქვს პროცესის nice value
pwd - დირექტორიის სახელი, რომელშიც მუშაობ
reboot - სისტემის გადატვირთვა
rm - ფაილის წაშლა
           	rm -r - დირექტორიის წაშლა
rmdir dir1 - დირექტორიის წაშლა (მაშინ როცა ცარიელია)
route –
setfacl – is used to set Access Control Lists (ACLs) for files and directories
           	setfacl -m u:username:rw file1 - იუზერის იღებს rw წვდომას file1-ზე
           	setfacl -x g:groupname file1 - შლის ACL წვდომებს ჯგუფისთვის file1-ზე
           	setfacl -d u::rwx, g::r-x, o::r-x dir1 - აძლევს default ACL წვდომებს dir1--ზე. იუზერს აქვს rwx, ჯგუფს და სხვებს - r-x
           	setfacl -m u:iser1:rw-, u:user2:r-- file1 – user1-ს აქვს rw წვდომა file1-ზე, user2-ს აქვს r წვდომა file1-ზე
shutdown -h now - თიშავს დაუყოვნებლივ
           	shutdown -h -t 90 - თიშავს 90 წამში
           	shutdown -r now - რესტარტი დაუყოვნებლივ
split -b200 lorem.txt – lorem.txt-ის ყოფს 200 ბიტიან ნაწილებად
           	split -b200 lorem.txt Danakopi_
           	split -b200 -d lorem.txt Danakopi_
           	split -b1M file - მეგაბაიტებში
           	split -l100 file – 100ხაზიანი დანაყოფები
           	split -n5 file  - 5 ტოლ ნაწილად დაყოფა
stat file - ბეჭდავს inode-ს + lists all the file attributes
strings - return each string type of characters that are printable in the file.
su - ცვლის/ანაცვლებს იუზერის credentials
           	su - root - ცვლის/ანაცვლებს root user-ს, სისტემა მოითხოვს root-ის პაროლს
sudo -i - წვდომა root იუზერზე, საშუალებას გვაძლევს გავაკეთოთ ის მოქმედებები, რაზეც აქამდე წვდომა არ გვქონდა
tail - ტექსტური ფაილის ბოლო რამდენიმე ხაზი გამოაქვს
           	-n N file.txt- გამოაქვს N რაოდენობის ხაზები ფაილიდან
           	-f – monitors log files in real-time
           	-c N - ბოლო N რაოდენობის ბაიტები გამოაქვს
           	-q – never print headers giving file names
           	-v – always print headers giving file names
touch file1 - ქმნის ფაილს
type [command] - ქომანდის ტიპს წერს
umask - გამოიყენება ახლადშექმნილი დირექტორიებისა და ფაილებისთვის წვდომების წასართმევად/მისანიჭებლად
uname - სისტემის კერნელ ინფორმაცია
           	-v - მიმდინარე კერნელის ვერსია
           	-r - მიმდინარე კერნელის გამოშვების ინფორმაცია
           	-a - ყველა ინფო მიმდინარე კერნელის შესახებ
uptime - სისტემა როგორ მდგომარეობაშია, მიმდინარე დრო, იუზერების რაოდენობა, სისტემის ჩატვირთვის საშუალო დრო
useradd -m tom - ამატებს იუზერ tom-ს (მხოლოდ root-დან)[-m უზრუნველყოფს ახალი home დირექტორიის შექმნას]
userdel username - იუზერის წაშლა home დირექტორიის გარეშე
           	useradd -m -u 777 -c “Jerry the Mouse” -s /bin/bash jerry [UID – 777; Comment – Jerry the Mouse; Shell - /bin/bash]
           	userdel -r username - იუზერის წაშლა home დირექტორიასთან ერთად
usermod -s /bin/bash tom - ცვლის default shell-ს ტომისტვის
           	usermod -aG cartoon tom - ამატებს იუზერ ტომს ჯგუფში cartoon
           	usermod – comment [-c] “Tom the Cat” tom - ცვლის/ქმნის კომენტარს ტომისთვის
           	usermod -u 444 tom - ცვლის UID-ს ტომისთვის
users - გამოაქვს ყველა იუზერის სახელი
whatis (name) - გამოაქვს name-ის მოკლე განმართება სახელმძღვანელო გვერდიდან [man -f]
whatis {command} - გამოაქვს მოეცმული ქომანდის მოკლე აღწერა
whereis (cmd) - აბრუნებს ბრძანებისა და მისი სახელმძღვანელო გვერდის სრულ გზას
which (command) - გამოაქვს რომელ ადგილას არის მოთავსებული command
whoami - გამოაქვს რომელ იუზერს ვიყენებთ
yes STRING – outputs any string that follows it repeatedly until killed (process is killed with Ctrl+C)
